Terraform Format and Style: success
Terraform Initialization: success
Terraform Validation: success
Terraform Plan: success

<details><summary>Show Plan</summary>

```

module.redis.data.cloudfoundry_space.space: Reading...
module.egress-space.data.cloudfoundry_org.org: Reading...
module.sns_sms.data.cloudfoundry_space.space: Reading...
module.database.data.cloudfoundry_space.space: Reading...
module.database.data.cloudfoundry_service.rds: Reading...
module.csv_upload_bucket.data.cloudfoundry_space.space: Reading...
module.ses_email.data.cloudfoundry_space.space: Reading...
module.csv_upload_bucket.data.cloudfoundry_service.s3: Reading...
module.sns_sms.data.cloudfoundry_service.sns: Reading...
module.redis.data.cloudfoundry_service.redis: Reading...
module.redis.data.cloudfoundry_service.redis: Read complete after 0s [id=045871d3-d9a8-4a9b-a844-00a067fab054]
data.cloudfoundry_org.org: Reading...
module.database.data.cloudfoundry_service.rds: Read complete after 1s [id=dcfb1d43-f22c-42d3-962c-7ae04eda24e7]
module.ses_email.data.cloudfoundry_service.ses: Reading...
module.csv_upload_bucket.data.cloudfoundry_service.s3: Read complete after 1s [id=440ce9d9-b108-4bbe-80b4-08338f3cc25b]
module.database.data.cloudfoundry_space.space: Read complete after 1s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.database.cloudfoundry_service_instance.rds: Refreshing state... [id=6267206c-b5ab-4dbb-8662-02f2ada85876]
module.ses_email.data.cloudfoundry_service.ses: Read complete after 0s [id=8bf5287d-587b-4696-8e53-a6ffdba211c0]
module.redis.data.cloudfoundry_space.space: Read complete after 1s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.redis.cloudfoundry_service_instance.redis: Refreshing state... [id=ccb2abc6-1986-4c55-b8cf-d21e313f26c2]
data.cloudfoundry_org.org: Read complete after 1s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.ses_email.data.cloudfoundry_space.space: Read complete after 1s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.ses_email.cloudfoundry_service_instance.ses: Refreshing state... [id=36cf8e1d-f2b7-4b44-9ef6-998393cb547f]
module.egress-space.data.cloudfoundry_org.org: Read complete after 1s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.egress-space.data.cloudfoundry_user.users["dd4002f6-951d-44b2-b88c-1b828e98dc01"]: Reading...
module.egress-space.cloudfoundry_space.public_egress: Refreshing state... [id=63506464-c7e2-4743-a7b3-4a8d45f14fb9]
module.csv_upload_bucket.data.cloudfoundry_space.space: Read complete after 1s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.csv_upload_bucket.cloudfoundry_service_instance.bucket: Refreshing state... [id=0d3aa4e5-7e26-4eef-bf6a-f12818b8a687]
module.sns_sms.data.cloudfoundry_space.space: Read complete after 1s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.sns_sms.data.cloudfoundry_service.sns: Read complete after 1s [id=37cbe836-d604-45d1-b1f8-1403f7cb3ff7]
module.sns_sms.cloudfoundry_service_instance.sns: Refreshing state... [id=ccaf756d-74a2-4903-b9cf-08ad0123ecbc]
module.egress-space.data.cloudfoundry_user.users["dd4002f6-951d-44b2-b88c-1b828e98dc01"]: Read complete after 0s [id=c51e169a-d8d0-4179-adff-ef871ba9e8ae]
module.egress-space.cloudfoundry_space_users.deployers: Refreshing state... [id=11c85b1d-3895-b7a0-260c-a036d272226d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudfoundry_space.notify-production will be created
  + resource "cloudfoundry_space" "notify-production" {
      + allow_ssh                = false
      + auditors                 = (known after apply)
      + delete_recursive_allowed = false
      + developers               = (known after apply)
      + id                       = (known after apply)
      + managers                 = (known after apply)
      + name                     = "notify-production"
      + org                      = "9e428562-a2d9-41b4-9c23-1ef5237fb44e"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.csv_upload_bucket.cloudfoundry_service_instance.bucket,
  on .terraform/modules/csv_upload_bucket/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ccostino, Action: `pull_request`*